РП/src/DocumentJournals/РегламентныеДокументыМеждународныйУчет/РегламентныеДокументыМеждународныйУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DocumentJournal>
  <name>РегламентныеДокументыМеждународныйУчет</name>
  <registeredDocuments>Document.РегламентнаяОперацияМеждународныйУчет</registeredDocuments>
  <registeredDocuments>Document.АмортизацияНМАМеждународныйУчет</registeredDocuments>
  <registeredDocuments>Document.АмортизацияОСМеждународныйУчет</registeredDocuments>
  <columns>
    <name>Организация</name>
  </columns>
  <columns>
    <name>Ответственный</name>
  </columns>
  <columns>
    <name>Комментарий</name>
  </columns>
  <columns>
    <name>ТипОперации</name>
  </columns>
</mdclass:DocumentJournal>

РП/src/Enums/ТипыРегламентныхОперацийМеждународныйУчет/ТипыРегламентныхОперацийМеждународныйУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРегламентныхОперацийМеждународныйУчет</name>
  <enumValues>
    <name>РасчетКурсовыхРазницФункциональнаяВалюта</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеСчетовДоходовРасходов</name>
  </enumValues>
  <enumValues>
    <name>РасчетКурсовыхРазницВалютаПредставления</name>
  </enumValues>
</mdclass:Enum>

РП/src/Documents/РегламентнаяОперацияМеждународныйУчет/РегламентнаяОперацияМеждународныйУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегламентнаяОперацияМеждународныйУчет</name>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВМеждународномУчете</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОперации</name>
    <type>
      <types>EnumRef.ТипыРегламентныхОперацийМеждународныйУчет</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

РП/src/DocumentJournals/РегламентныеДокументыМеждународныйУчет/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
		"Организация",
		Организация);
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеОтчетыИОбработкиКлиентСервер.ТипФормыСписка());
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	

	ОбщегоНазначенияУТ.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект, "Список", "Дата");


КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Организация = Настройки.Получить("Организация");

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
		"Организация",
		Организация);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияОтборПриИзменении(Элемент)

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
		"Организация",
		Организация);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура АмортизацияОС(Команда)
	
	ДанныеЗаполнения = Новый Структура("Организация", Организация);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения);
	ОткрытьФорму("Документ.АмортизацияОСМеждународныйУчет.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура АмортизацияНМА(Команда)
	
	ДанныеЗаполнения = Новый Структура("Организация", Организация);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения);
	ОткрытьФорму("Документ.АмортизацияНМАМеждународныйУчет.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетКурсовыхРазницФункциональнаяВалюта(Команда)
	
	ОткрытьФормуНовогоДокумента(ПредопределенноеЗначение("Перечисление.ТипыРегламентныхОперацийМеждународныйУчет.РасчетКурсовыхРазницФункциональнаяВалюта"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеСчетовДоходаРасхода(Команда)
	
	ОткрытьФормуНовогоДокумента(ПредопределенноеЗначение("Перечисление.ТипыРегламентныхОперацийМеждународныйУчет.ЗакрытиеСчетовДоходовРасходов"));
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетКурсовыхРазницВалютаПредставления(Команда)
	
	ОткрытьФормуНовогоДокумента(ПредопределенноеЗначение("Перечисление.ТипыРегламентныхОперацийМеждународныйУчет.РасчетКурсовыхРазницВалютаПредставления"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуНовогоДокумента(ТипОперации)
	
	ДанныеЗаполнения = Новый Структура("ТипОперации", ТипОперации);
	Если НЕ Организация.Пустая() Тогда
		ДанныеЗаполнения.Вставить("Организация", Организация);
	КонецЕсли;
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения);
	ОткрытьФорму("Документ.РегламентнаяОперацияМеждународныйУчет.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти
